grevaillot/svd_tools/headers/STM32H7x7_CM7/exti.h
#define EXTI_D3PCR2H_PCS50_SHIFT		4
#define EXTI_D3PCR2H_PCS50_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs50 PCS50 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2H_PCS49_SHIFT		2
#define EXTI_D3PCR2H_PCS49_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs49 PCS49 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


#define EXTI_D3PCR2H_PCS48_SHIFT		0
#define EXTI_D3PCR2H_PCS48_MASK		0x03
/** @defgroup exti_d3pcr2h_pcs48 PCS48 Pending request clear input signal selection on Event input x= truncate ((n+96)/2)
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_rtsr3 RTSR3 EXTI rising trigger selection register
@{*/

/** EXTI_RTSR3_TR86 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR86		(1 << 22)
/** EXTI_RTSR3_TR85 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR85		(1 << 21)
/** EXTI_RTSR3_TR84 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR84		(1 << 20)
/** EXTI_RTSR3_TR82 Rising trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_RTSR3_TR82		(1 << 18)

/**@}*/

/** @defgroup exti_ftsr3 FTSR3 EXTI falling trigger selection register
@{*/

/** EXTI_FTSR3_TR86 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR86		(1 << 22)
/** EXTI_FTSR3_TR85 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR85		(1 << 21)
/** EXTI_FTSR3_TR84 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR84		(1 << 20)
/** EXTI_FTSR3_TR82 Falling trigger event configuration bit of Configurable Event input x+64 **/
#define EXTI_FTSR3_TR82		(1 << 18)

/**@}*/

/** @defgroup exti_swier3 SWIER3 EXTI software interrupt event register
@{*/

/** EXTI_SWIER3_SWIER86 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER86		(1 << 22)
/** EXTI_SWIER3_SWIER85 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER85		(1 << 21)
/** EXTI_SWIER3_SWIER84 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER84		(1 << 20)
/** EXTI_SWIER3_SWIER82 Software interrupt on line x+64 **/
#define EXTI_SWIER3_SWIER82		(1 << 18)

/**@}*/

/** @defgroup exti_d3pmr3 D3PMR3 EXTI D3 pending mask register
@{*/

/** EXTI_D3PMR3_MR88 D3 Pending Mask on Event input x+64 **/
#define EXTI_D3PMR3_MR88		(1 << 24)

/**@}*/

/** @defgroup exti_d3pcr3h D3PCR3H EXTI D3 pending clear selection register high
@{*/


#define EXTI_D3PCR3H_PCS88_SHIFT		18
#define EXTI_D3PCR3H_PCS88_MASK		0x03
/** @defgroup exti_d3pcr3h_pcs88 PCS88 D3 Pending request clear input signal selection on Event input x= truncate N+160/2
@{*/
/**@}*/


/**@}*/

/** @defgroup exti_c1imr1 C1IMR1 EXTI interrupt mask register
@{*/

/** EXTI_C1IMR1_MR31 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR31		(1 << 31)
/** EXTI_C1IMR1_MR30 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR30		(1 << 30)
/** EXTI_C1IMR1_MR29 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR29		(1 << 29)
/** EXTI_C1IMR1_MR28 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR28		(1 << 28)
/** EXTI_C1IMR1_MR27 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR27		(1 << 27)
/** EXTI_C1IMR1_MR26 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR26		(1 << 26)
/** EXTI_C1IMR1_MR25 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR25		(1 << 25)
/** EXTI_C1IMR1_MR24 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR24		(1 << 24)
/** EXTI_C1IMR1_MR23 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR23		(1 << 23)
/** EXTI_C1IMR1_MR22 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR22		(1 << 22)
/** EXTI_C1IMR1_MR21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR21		(1 << 21)
/** EXTI_C1IMR1_MR20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR20		(1 << 20)
/** EXTI_C1IMR1_MR19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR19		(1 << 19)
/** EXTI_C1IMR1_MR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR18		(1 << 18)
/** EXTI_C1IMR1_MR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR17		(1 << 17)
/** EXTI_C1IMR1_MR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR16		(1 << 16)
/** EXTI_C1IMR1_MR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR15		(1 << 15)
/** EXTI_C1IMR1_MR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR14		(1 << 14)
/** EXTI_C1IMR1_MR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR13		(1 << 13)
/** EXTI_C1IMR1_MR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR12		(1 << 12)
/** EXTI_C1IMR1_MR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR11		(1 << 11)
/** EXTI_C1IMR1_MR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR10		(1 << 10)
/** EXTI_C1IMR1_MR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR9		(1 << 9)
/** EXTI_C1IMR1_MR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR8		(1 << 8)
/** EXTI_C1IMR1_MR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR7		(1 << 7)
/** EXTI_C1IMR1_MR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR6		(1 << 6)
/** EXTI_C1IMR1_MR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR5		(1 << 5)
/** EXTI_C1IMR1_MR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR4		(1 << 4)
/** EXTI_C1IMR1_MR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR3		(1 << 3)
/** EXTI_C1IMR1_MR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR2		(1 << 2)
/** EXTI_C1IMR1_MR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR1		(1 << 1)
/** EXTI_C1IMR1_MR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C1IMR1_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_c1emr1 C1EMR1 EXTI event mask register
@{*/

/** EXTI_C1EMR1_MR31 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR31		(1 << 31)
/** EXTI_C1EMR1_MR30 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR30		(1 << 30)
/** EXTI_C1EMR1_MR29 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR29		(1 << 29)
/** EXTI_C1EMR1_MR28 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR28		(1 << 28)
/** EXTI_C1EMR1_MR27 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR27		(1 << 27)
/** EXTI_C1EMR1_MR26 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR26		(1 << 26)
/** EXTI_C1EMR1_MR25 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR25		(1 << 25)
/** EXTI_C1EMR1_MR24 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR24		(1 << 24)
/** EXTI_C1EMR1_MR23 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR23		(1 << 23)
/** EXTI_C1EMR1_MR22 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR22		(1 << 22)
/** EXTI_C1EMR1_MR21 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR21		(1 << 21)
/** EXTI_C1EMR1_MR20 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR20		(1 << 20)
/** EXTI_C1EMR1_MR19 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR19		(1 << 19)
/** EXTI_C1EMR1_MR18 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR18		(1 << 18)
/** EXTI_C1EMR1_MR17 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR17		(1 << 17)
/** EXTI_C1EMR1_MR16 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR16		(1 << 16)
/** EXTI_C1EMR1_MR15 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR15		(1 << 15)
/** EXTI_C1EMR1_MR14 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR14		(1 << 14)
/** EXTI_C1EMR1_MR13 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR13		(1 << 13)
/** EXTI_C1EMR1_MR12 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR12		(1 << 12)
/** EXTI_C1EMR1_MR11 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR11		(1 << 11)
/** EXTI_C1EMR1_MR10 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR10		(1 << 10)
/** EXTI_C1EMR1_MR9 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR9		(1 << 9)
/** EXTI_C1EMR1_MR8 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR8		(1 << 8)
/** EXTI_C1EMR1_MR7 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR7		(1 << 7)
/** EXTI_C1EMR1_MR6 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR6		(1 << 6)
/** EXTI_C1EMR1_MR5 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR5		(1 << 5)
/** EXTI_C1EMR1_MR4 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR4		(1 << 4)
/** EXTI_C1EMR1_MR3 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR3		(1 << 3)
/** EXTI_C1EMR1_MR2 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR2		(1 << 2)
/** EXTI_C1EMR1_MR1 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR1		(1 << 1)
/** EXTI_C1EMR1_MR0 CPU Event mask on Event input x **/
#define EXTI_C1EMR1_MR0		(1 << 0)

/**@}*/

