grevaillot/svd_tools/headers/STM32H7x7_CM7/exti.h
/** @defgroup exti_c1pr1 C1PR1 EXTI pending register
@{*/

/** EXTI_C1PR1_PR21 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR21		(1 << 21)
/** EXTI_C1PR1_PR20 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR20		(1 << 20)
/** EXTI_C1PR1_PR19 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR19		(1 << 19)
/** EXTI_C1PR1_PR18 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR18		(1 << 18)
/** EXTI_C1PR1_PR17 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR17		(1 << 17)
/** EXTI_C1PR1_PR16 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR16		(1 << 16)
/** EXTI_C1PR1_PR15 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR15		(1 << 15)
/** EXTI_C1PR1_PR14 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR14		(1 << 14)
/** EXTI_C1PR1_PR13 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR13		(1 << 13)
/** EXTI_C1PR1_PR12 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR12		(1 << 12)
/** EXTI_C1PR1_PR11 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR11		(1 << 11)
/** EXTI_C1PR1_PR10 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR10		(1 << 10)
/** EXTI_C1PR1_PR9 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR9		(1 << 9)
/** EXTI_C1PR1_PR8 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR8		(1 << 8)
/** EXTI_C1PR1_PR7 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR7		(1 << 7)
/** EXTI_C1PR1_PR6 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR6		(1 << 6)
/** EXTI_C1PR1_PR5 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR5		(1 << 5)
/** EXTI_C1PR1_PR4 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR4		(1 << 4)
/** EXTI_C1PR1_PR3 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR3		(1 << 3)
/** EXTI_C1PR1_PR2 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR2		(1 << 2)
/** EXTI_C1PR1_PR1 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR1		(1 << 1)
/** EXTI_C1PR1_PR0 CPU Event mask on Event input x **/
#define EXTI_C1PR1_PR0		(1 << 0)

/**@}*/

/** @defgroup exti_c1imr2 C1IMR2 EXTI interrupt mask register
@{*/

/** EXTI_C1IMR2_MR31 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR31		(1 << 31)
/** EXTI_C1IMR2_MR30 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR30		(1 << 30)
/** EXTI_C1IMR2_MR29 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR29		(1 << 29)
/** EXTI_C1IMR2_MR28 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR28		(1 << 28)
/** EXTI_C1IMR2_MR27 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR27		(1 << 27)
/** EXTI_C1IMR2_MR26 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR26		(1 << 26)
/** EXTI_C1IMR2_MR25 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR25		(1 << 25)
/** EXTI_C1IMR2_MR24 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR24		(1 << 24)
/** EXTI_C1IMR2_MR23 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR23		(1 << 23)
/** EXTI_C1IMR2_MR22 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR22		(1 << 22)
/** EXTI_C1IMR2_MR21 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR21		(1 << 21)
/** EXTI_C1IMR2_MR20 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR20		(1 << 20)
/** EXTI_C1IMR2_MR19 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR19		(1 << 19)
/** EXTI_C1IMR2_MR18 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR18		(1 << 18)
/** EXTI_C1IMR2_MR17 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR17		(1 << 17)
/** EXTI_C1IMR2_MR16 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR16		(1 << 16)
/** EXTI_C1IMR2_MR15 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR15		(1 << 15)
/** EXTI_C1IMR2_MR14 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR14		(1 << 14)
/** EXTI_C1IMR2_MR12 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR12		(1 << 12)
/** EXTI_C1IMR2_MR11 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR11		(1 << 11)
/** EXTI_C1IMR2_MR10 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR10		(1 << 10)
/** EXTI_C1IMR2_MR9 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR9		(1 << 9)
/** EXTI_C1IMR2_MR8 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR8		(1 << 8)
/** EXTI_C1IMR2_MR7 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR7		(1 << 7)
/** EXTI_C1IMR2_MR6 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR6		(1 << 6)
/** EXTI_C1IMR2_MR5 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR5		(1 << 5)
/** EXTI_C1IMR2_MR4 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR4		(1 << 4)
/** EXTI_C1IMR2_MR3 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR3		(1 << 3)
/** EXTI_C1IMR2_MR2 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR2		(1 << 2)
/** EXTI_C1IMR2_MR1 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR1		(1 << 1)
/** EXTI_C1IMR2_MR0 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1IMR2_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_c1emr2 C1EMR2 EXTI event mask register
@{*/

/** EXTI_C1EMR2_MR63 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR63		(1 << 31)
/** EXTI_C1EMR2_MR62 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR62		(1 << 30)
/** EXTI_C1EMR2_MR61 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR61		(1 << 29)
/** EXTI_C1EMR2_MR60 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR60		(1 << 28)
/** EXTI_C1EMR2_MR59 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR59		(1 << 27)
/** EXTI_C1EMR2_MR58 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR58		(1 << 26)
/** EXTI_C1EMR2_MR57 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR57		(1 << 25)
/** EXTI_C1EMR2_MR56 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR56		(1 << 24)
/** EXTI_C1EMR2_MR55 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR55		(1 << 23)
/** EXTI_C1EMR2_MR54 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR54		(1 << 22)
/** EXTI_C1EMR2_MR53 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR53		(1 << 21)
/** EXTI_C1EMR2_MR52 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR52		(1 << 20)
/** EXTI_C1EMR2_MR51 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR51		(1 << 19)
/** EXTI_C1EMR2_MR50 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR50		(1 << 18)
/** EXTI_C1EMR2_MR49 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR49		(1 << 17)
/** EXTI_C1EMR2_MR48 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR48		(1 << 16)
/** EXTI_C1EMR2_MR47 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR47		(1 << 15)
/** EXTI_C1EMR2_MR46 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR46		(1 << 14)
/** EXTI_C1EMR2_MR44 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR44		(1 << 12)
/** EXTI_C1EMR2_MR43 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR43		(1 << 11)
/** EXTI_C1EMR2_MR42 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR42		(1 << 10)
/** EXTI_C1EMR2_MR41 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR41		(1 << 9)
/** EXTI_C1EMR2_MR40 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR40		(1 << 8)
/** EXTI_C1EMR2_MR39 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR39		(1 << 7)
/** EXTI_C1EMR2_MR38 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR38		(1 << 6)
/** EXTI_C1EMR2_MR37 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR37		(1 << 5)
/** EXTI_C1EMR2_MR36 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR36		(1 << 4)
/** EXTI_C1EMR2_MR35 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR35		(1 << 3)
/** EXTI_C1EMR2_MR34 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR34		(1 << 2)
/** EXTI_C1EMR2_MR33 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR33		(1 << 1)
/** EXTI_C1EMR2_MR32 CPU Interrupt Mask on Direct Event input x+32 **/
#define EXTI_C1EMR2_MR32		(1 << 0)

/**@}*/

/** @defgroup exti_c1pr2 C1PR2 EXTI pending register
@{*/

/** EXTI_C1PR2_PR51 Configurable event inputs x+32 Pending bit **/
#define EXTI_C1PR2_PR51		(1 << 19)
/** EXTI_C1PR2_PR49 Configurable event inputs x+32 Pending bit **/
#define EXTI_C1PR2_PR49		(1 << 17)

/**@}*/

/** @defgroup exti_c1imr3 C1IMR3 EXTI interrupt mask register
@{*/

