grevaillot/svd_tools/headers/STM32H7x7_CM7/exti.h
/** EXTI_C1IMR3_MR88 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR88		(1 << 24)
/** EXTI_C1IMR3_MR87 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR87		(1 << 23)
/** EXTI_C1IMR3_MR86 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR86		(1 << 22)
/** EXTI_C1IMR3_MR85 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR85		(1 << 21)
/** EXTI_C1IMR3_MR84 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR84		(1 << 20)
/** EXTI_C1IMR3_MR82 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR82		(1 << 18)
/** EXTI_C1IMR3_MR80 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR80		(1 << 16)
/** EXTI_C1IMR3_MR79 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR79		(1 << 15)
/** EXTI_C1IMR3_MR78 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR78		(1 << 14)
/** EXTI_C1IMR3_MR77 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR77		(1 << 13)
/** EXTI_C1IMR3_MR76 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR76		(1 << 12)
/** EXTI_C1IMR3_MR75 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR75		(1 << 11)
/** EXTI_C1IMR3_MR74 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR74		(1 << 10)
/** EXTI_C1IMR3_MR73 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR73		(1 << 9)
/** EXTI_C1IMR3_MR72 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR72		(1 << 8)
/** EXTI_C1IMR3_MR71 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR71		(1 << 7)
/** EXTI_C1IMR3_MR70 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR70		(1 << 6)
/** EXTI_C1IMR3_MR69 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR69		(1 << 5)
/** EXTI_C1IMR3_MR68 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR68		(1 << 4)
/** EXTI_C1IMR3_MR67 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR67		(1 << 3)
/** EXTI_C1IMR3_MR66 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR66		(1 << 2)
/** EXTI_C1IMR3_MR65 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR65		(1 << 1)
/** EXTI_C1IMR3_MR64 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C1IMR3_MR64		(1 << 0)

/**@}*/

/** @defgroup exti_c1emr3 C1EMR3 EXTI event mask register
@{*/

/** EXTI_C1EMR3_MR88 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR88		(1 << 24)
/** EXTI_C1EMR3_MR87 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR87		(1 << 23)
/** EXTI_C1EMR3_MR86 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR86		(1 << 22)
/** EXTI_C1EMR3_MR85 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR85		(1 << 21)
/** EXTI_C1EMR3_MR84 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR84		(1 << 20)
/** EXTI_C1EMR3_MR82 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR82		(1 << 18)
/** EXTI_C1EMR3_MR80 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR80		(1 << 16)
/** EXTI_C1EMR3_MR79 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR79		(1 << 15)
/** EXTI_C1EMR3_MR78 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR78		(1 << 14)
/** EXTI_C1EMR3_MR77 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR77		(1 << 13)
/** EXTI_C1EMR3_MR76 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR76		(1 << 12)
/** EXTI_C1EMR3_MR75 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR75		(1 << 11)
/** EXTI_C1EMR3_MR74 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR74		(1 << 10)
/** EXTI_C1EMR3_MR73 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR73		(1 << 9)
/** EXTI_C1EMR3_MR72 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR72		(1 << 8)
/** EXTI_C1EMR3_MR71 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR71		(1 << 7)
/** EXTI_C1EMR3_MR70 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR70		(1 << 6)
/** EXTI_C1EMR3_MR69 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR69		(1 << 5)
/** EXTI_C1EMR3_MR68 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR68		(1 << 4)
/** EXTI_C1EMR3_MR67 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR67		(1 << 3)
/** EXTI_C1EMR3_MR66 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR66		(1 << 2)
/** EXTI_C1EMR3_MR65 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR65		(1 << 1)
/** EXTI_C1EMR3_MR64 CPU Event mask on Event input x+64 **/
#define EXTI_C1EMR3_MR64		(1 << 0)

/**@}*/

/** @defgroup exti_c1pr3 C1PR3 EXTI pending register
@{*/

/** EXTI_C1PR3_PR86 Configurable event inputs x+64 Pending bit **/
#define EXTI_C1PR3_PR86		(1 << 22)
/** EXTI_C1PR3_PR85 Configurable event inputs x+64 Pending bit **/
#define EXTI_C1PR3_PR85		(1 << 21)
/** EXTI_C1PR3_PR84 Configurable event inputs x+64 Pending bit **/
#define EXTI_C1PR3_PR84		(1 << 20)
/** EXTI_C1PR3_PR82 Configurable event inputs x+64 Pending bit **/
#define EXTI_C1PR3_PR82		(1 << 18)

/**@}*/

/** @defgroup exti_c2imr1 C2IMR1 EXTI interrupt mask register
@{*/

/** EXTI_C2IMR1_MR31 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR31		(1 << 31)
/** EXTI_C2IMR1_MR30 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR30		(1 << 30)
/** EXTI_C2IMR1_MR29 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR29		(1 << 29)
/** EXTI_C2IMR1_MR28 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR28		(1 << 28)
/** EXTI_C2IMR1_MR27 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR27		(1 << 27)
/** EXTI_C2IMR1_MR26 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR26		(1 << 26)
/** EXTI_C2IMR1_MR25 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR25		(1 << 25)
/** EXTI_C2IMR1_MR24 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR24		(1 << 24)
/** EXTI_C2IMR1_MR23 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR23		(1 << 23)
/** EXTI_C2IMR1_MR22 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR22		(1 << 22)
/** EXTI_C2IMR1_MR21 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR21		(1 << 21)
/** EXTI_C2IMR1_MR20 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR20		(1 << 20)
/** EXTI_C2IMR1_MR19 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR19		(1 << 19)
/** EXTI_C2IMR1_MR18 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR18		(1 << 18)
/** EXTI_C2IMR1_MR17 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR17		(1 << 17)
/** EXTI_C2IMR1_MR16 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR16		(1 << 16)
/** EXTI_C2IMR1_MR15 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR15		(1 << 15)
/** EXTI_C2IMR1_MR14 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR14		(1 << 14)
/** EXTI_C2IMR1_MR13 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR13		(1 << 13)
/** EXTI_C2IMR1_MR12 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR12		(1 << 12)
/** EXTI_C2IMR1_MR11 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR11		(1 << 11)
/** EXTI_C2IMR1_MR10 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR10		(1 << 10)
/** EXTI_C2IMR1_MR9 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR9		(1 << 9)
/** EXTI_C2IMR1_MR8 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR8		(1 << 8)
/** EXTI_C2IMR1_MR7 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR7		(1 << 7)
/** EXTI_C2IMR1_MR6 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR6		(1 << 6)
/** EXTI_C2IMR1_MR5 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR5		(1 << 5)
/** EXTI_C2IMR1_MR4 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR4		(1 << 4)
/** EXTI_C2IMR1_MR3 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR3		(1 << 3)
/** EXTI_C2IMR1_MR2 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR2		(1 << 2)
/** EXTI_C2IMR1_MR1 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR1		(1 << 1)
/** EXTI_C2IMR1_MR0 Rising trigger event configuration bit of Configurable Event input **/
#define EXTI_C2IMR1_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_c2emr1 C2EMR1 EXTI event mask register
@{*/

/** EXTI_C2EMR1_MR31 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR31		(1 << 31)
/** EXTI_C2EMR1_MR30 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR30		(1 << 30)
/** EXTI_C2EMR1_MR29 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR29		(1 << 29)
/** EXTI_C2EMR1_MR28 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR28		(1 << 28)
/** EXTI_C2EMR1_MR27 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR27		(1 << 27)
/** EXTI_C2EMR1_MR26 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR26		(1 << 26)
/** EXTI_C2EMR1_MR25 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR25		(1 << 25)
/** EXTI_C2EMR1_MR24 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR24		(1 << 24)
/** EXTI_C2EMR1_MR23 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR23		(1 << 23)
/** EXTI_C2EMR1_MR22 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR22		(1 << 22)
/** EXTI_C2EMR1_MR21 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR21		(1 << 21)
/** EXTI_C2EMR1_MR20 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR20		(1 << 20)
/** EXTI_C2EMR1_MR19 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR19		(1 << 19)
/** EXTI_C2EMR1_MR18 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR18		(1 << 18)
/** EXTI_C2EMR1_MR17 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR17		(1 << 17)
/** EXTI_C2EMR1_MR16 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR16		(1 << 16)
/** EXTI_C2EMR1_MR15 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR15		(1 << 15)
/** EXTI_C2EMR1_MR14 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR14		(1 << 14)
/** EXTI_C2EMR1_MR13 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR13		(1 << 13)
/** EXTI_C2EMR1_MR12 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR12		(1 << 12)
/** EXTI_C2EMR1_MR11 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR11		(1 << 11)
/** EXTI_C2EMR1_MR10 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR10		(1 << 10)
/** EXTI_C2EMR1_MR9 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR9		(1 << 9)
/** EXTI_C2EMR1_MR8 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR8		(1 << 8)
/** EXTI_C2EMR1_MR7 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR7		(1 << 7)
/** EXTI_C2EMR1_MR6 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR6		(1 << 6)
/** EXTI_C2EMR1_MR5 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR5		(1 << 5)
/** EXTI_C2EMR1_MR4 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR4		(1 << 4)
/** EXTI_C2EMR1_MR3 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR3		(1 << 3)
/** EXTI_C2EMR1_MR2 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR2		(1 << 2)
/** EXTI_C2EMR1_MR1 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR1		(1 << 1)
/** EXTI_C2EMR1_MR0 CPU Event mask on Event input x **/
#define EXTI_C2EMR1_MR0		(1 << 0)

/**@}*/

/** @defgroup exti_c2pr1 C2PR1 EXTI pending register
@{*/

