grevaillot/svd_tools/headers/STM32H7x7_CM7/exti.h
/** EXTI_C2IMR3_MR88 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR88		(1 << 24)
/** EXTI_C2IMR3_MR87 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR87		(1 << 23)
/** EXTI_C2IMR3_MR86 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR86		(1 << 22)
/** EXTI_C2IMR3_MR85 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR85		(1 << 21)
/** EXTI_C2IMR3_MR84 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR84		(1 << 20)
/** EXTI_C2IMR3_MR82 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR82		(1 << 18)
/** EXTI_C2IMR3_MR80 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR80		(1 << 16)
/** EXTI_C2IMR3_MR79 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR79		(1 << 15)
/** EXTI_C2IMR3_MR78 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR78		(1 << 14)
/** EXTI_C2IMR3_MR77 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR77		(1 << 13)
/** EXTI_C2IMR3_MR76 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR76		(1 << 12)
/** EXTI_C2IMR3_MR75 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR75		(1 << 11)
/** EXTI_C2IMR3_MR74 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR74		(1 << 10)
/** EXTI_C2IMR3_MR73 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR73		(1 << 9)
/** EXTI_C2IMR3_MR72 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR72		(1 << 8)
/** EXTI_C2IMR3_MR71 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR71		(1 << 7)
/** EXTI_C2IMR3_MR70 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR70		(1 << 6)
/** EXTI_C2IMR3_MR69 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR69		(1 << 5)
/** EXTI_C2IMR3_MR68 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR68		(1 << 4)
/** EXTI_C2IMR3_MR67 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR67		(1 << 3)
/** EXTI_C2IMR3_MR66 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR66		(1 << 2)
/** EXTI_C2IMR3_MR65 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR65		(1 << 1)
/** EXTI_C2IMR3_MR64 CPU Interrupt Mask on Direct Event input x+64 **/
#define EXTI_C2IMR3_MR64		(1 << 0)

/**@}*/

/** @defgroup exti_c2emr3 C2EMR3 EXTI event mask register
@{*/

/** EXTI_C2EMR3_MR88 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR88		(1 << 24)
/** EXTI_C2EMR3_MR87 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR87		(1 << 23)
/** EXTI_C2EMR3_MR86 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR86		(1 << 22)
/** EXTI_C2EMR3_MR85 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR85		(1 << 21)
/** EXTI_C2EMR3_MR84 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR84		(1 << 20)
/** EXTI_C2EMR3_MR82 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR82		(1 << 18)
/** EXTI_C2EMR3_MR80 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR80		(1 << 16)
/** EXTI_C2EMR3_MR79 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR79		(1 << 15)
/** EXTI_C2EMR3_MR78 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR78		(1 << 14)
/** EXTI_C2EMR3_MR77 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR77		(1 << 13)
/** EXTI_C2EMR3_MR76 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR76		(1 << 12)
/** EXTI_C2EMR3_MR75 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR75		(1 << 11)
/** EXTI_C2EMR3_MR74 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR74		(1 << 10)
/** EXTI_C2EMR3_MR73 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR73		(1 << 9)
/** EXTI_C2EMR3_MR72 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR72		(1 << 8)
/** EXTI_C2EMR3_MR71 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR71		(1 << 7)
/** EXTI_C2EMR3_MR70 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR70		(1 << 6)
/** EXTI_C2EMR3_MR69 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR69		(1 << 5)
/** EXTI_C2EMR3_MR68 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR68		(1 << 4)
/** EXTI_C2EMR3_MR67 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR67		(1 << 3)
/** EXTI_C2EMR3_MR66 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR66		(1 << 2)
/** EXTI_C2EMR3_MR65 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR65		(1 << 1)
/** EXTI_C2EMR3_MR64 CPU Event mask on Event input x+64 **/
#define EXTI_C2EMR3_MR64		(1 << 0)

/**@}*/

/** @defgroup exti_c2pr3 C2PR3 EXTI pending register
@{*/

/** EXTI_C2PR3_PR86 Configurable event inputs x+64 Pending bit **/
#define EXTI_C2PR3_PR86		(1 << 22)
/** EXTI_C2PR3_PR85 Configurable event inputs x+64 Pending bit **/
#define EXTI_C2PR3_PR85		(1 << 21)
/** EXTI_C2PR3_PR84 Configurable event inputs x+64 Pending bit **/
#define EXTI_C2PR3_PR84		(1 << 20)
/** EXTI_C2PR3_PR82 Configurable event inputs x+64 Pending bit **/
#define EXTI_C2PR3_PR82		(1 << 18)

/**@}*/
